#include <cstdlib>

/*
 * Дана последовательность числовых значений.
 * Признак окончания последовательности введенный ноль.
 * Требуется написать программу, которая на основе частотного анализа числовой последовательности формирует таблицу,
 * в первом столбце стоят значения элементов, во втором столбце частота появления соответствующего числа.
 * Данные должны выдаваться в порядке возрастания числовых значений.
 * Оценить сложность алгоритма и время выполнения.
 *
 * */

int main() {


    return EXIT_SUCCESS;
}