#include <cstdlib>

/*
 *
 * Оператор мобильной связи организовал базу данных абонентов,
 * содержащую сведения о телефонах, их владельцах и используемых тарифах, в виде бинарного дерева.
 *
 * Разработать программу, которая:
 * обеспечивает начальное формирование базы данных в виде бинарного дерева;
 * производит вывод всей базы данных;
 * производит поиск владельца по номеру телефона;
 * выводит наиболее востребованный тариф (по наибольшему числу абонентов).
 *
 * */

int main() {


    return EXIT_SUCCESS;
}